In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['col2'].unique()

array([444, 555, 666])

In [6]:
df['col1'].nunique()

4

In [9]:
df['col3'].value_counts()

col3
abc    1
def    1
ghi    1
xyz    1
Name: count, dtype: int64

In [4]:
df['col1'].unique(  )

array([1, 2, 3, 4])

In [10]:
def times2(nums):
    return nums**2

In [13]:
df['col1'].agg(times2)

/tmp/ipykernel_47509/2101261003.py:1: FutureWarning: using <function times2 at 0x731ce4236b90> in Series.agg cannot aggregate and has been deprecated. Use Series.transform to keep behavior unchanged.
  df['col1'].agg(times2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [14]:
df['col1'].apply(times2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [16]:
df['col4']=df['col1']/df['col2']

In [19]:
df

   col1  col2 col3      col4
0     1   444  abc  0.002252
1     2   555  def  0.003604
2     3   666  ghi  0.004505
3     4   444  xyz  0.009009

In [22]:
df.drop('col4',axis=1,inplace=True)

In [23]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [24]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi